Documents/ВводНачальныхДанныхЗакрепления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводНачальныхДанныхЗакрепления</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаОтдел</xr:Item>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПривязкаСотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаСотрудник</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаОтдел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтдел</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПулПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РольОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РольОтдела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выездной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводНачальныхДанныхЗакрепления/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		// регистр ПривязкаСотрудник 
		Движение = Движения.ПривязкаСотрудник.Добавить();
		Движение.Период 	= Дата;
		Движение.Должник 	= ТекСтрокаДолжники.Должник;
		Движение.Сотрудник 	= ТекСтрокаДолжники.Сотрудник;
		Движение.СотрМенеджер 	= ТекСтрокаДолжники.Сотрудник;
		
		// регистр ПривязкаОтдел 
		Движение = Движения.ПривязкаОтдел.Добавить();
		Движение.Период 		= Дата;
		Движение.Должник 		= ТекСтрокаДолжники.Должник;
		Движение.Отдел 			= ТекСтрокаДолжники.Отдел;
		Если ТекСтрокаДолжники.Отдел.РольОтдела = Перечисления.РольОтдела.Архив Тогда
			Движение.СвободныйПул = Ложь;
		ИначеЕсли ТекСтрокаДолжники.Сотрудник.Пустая() Тогда
			Движение.СвободныйПул = Истина;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
